[Message tracking from Cisco ESA logging - Summary search]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 07 * * * *
dispatch.earliest_time = -2h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
schedule_window = 15
search = index=main sourcetype=cisco:esa:textmail earliest=-1h@h-15m latest=@h\
| fields dest_ip,src_ip,source_domain,internal_message_id,rid,icid,dcid,recipient,host,sender,spam_status,message_subject,message_size,action \
| rex field=_raw "MID \d+ RID \[[^\]]+\] Response \'(?<recipient_status>[^\']+)\'" \
| rex field=_raw "\w+: DCID \d+ MID \d+ to RID \d+ - (?<recipient_status>.+)" \
| rex field=_raw "New SMTP ICID \d+ interface (?<src_interface>.+) \(" \
| rex field=_raw "MID \d+ antivirus (?<vendor_av_verdict>.+)" \
| rex field=_raw "MID \d+ Outbreak Filters: verdict (?<vendor_outbreak_verdict>.+)" \
| rex field=_raw "MID \d+ Threat Level=(?<severity_id>\d+) Category=(?<category>\S+)" \
| rex field=_raw "MID \d+ was(?<vendor_outbreak_verdict>too big)" \
| rex field=_raw "DCID \d+ TLS success protocol (?<vendor_ssl_cipher_outbound>.+)" \
| rex field=_raw "DCID \d+ TLS failed: (?<vendor_ssl_cipher_outbound>.+)" \
| rex field=_raw "MID \d+ ICID \d+ (RID \d+ )?To: \S+ (?<recipient_status>.+)"\
| rex field=_raw "ICID \d+ TLS success protocol (?<vendor_ssl_cipher_inbound>.+)"\
| rex field=_raw "ICID \d+ TLS failed: \(\d+, '(?<vendor_ssl_cipher_inbound>[^']+)"\
| rex field=_raw "RID \[(?<rid>[\d\s,]+)\]" \
| rex field=_raw "MID \d+ attachment '(?<file_name>[^']+)'" \
| eval rid=trim(split(rid,",")) \
| where mvcount(rid)<=1 OR isnull(rid) \
| eval mid_rid = internal_message_id . "-" . rid \
| append \
    [ search index=main sourcetype=cisco:esa:textmail earliest=-1h@h-15m latest=@h "RID [" \
    | fields internal_message_id,action,dest_ip,recipient,dcid,rid \
    | rex field=_raw "RID \[(?<rid>[\d\s,]+)\]" \
    | rex field=_raw "MID \d+ RID \[[^\]]+\] Response \'(?<recipient_status>[^\']+)\'" \
    | eval rid=trim(split(rid,",")) \
    | where mvcount(rid)>1 \
    | mvexpand rid \
    | eval mid_rid = internal_message_id . "-" . rid] \
| eventstats values(dest_ip) as src_ip by icid,host \
| eventstats values(src_interface) as src_interface by icid,host \
| eventstats values(vendor_ssl_cipher_inbound) as vendor_ssl_cipher_inbound by icid,host \
| eventstats earliest(_time) as begin by mid_rid,host \
| eventstats values(recipient) as recipient by mid_rid,host \
| eventstats values(recipient_status) as recipient_status by mid_rid,host \
| eventstats earliest(src_ip) as src_ip by internal_message_id,host \
| eventstats dc(recipient) as recipient_count by internal_message_id,host \
| eventstats earliest(src_interface) as src_interface by internal_message_id,host \
| eventstats values(vendor_ssl_cipher_inbound) as vendor_ssl_cipher_inbound by internal_message_id,host \
| eventstats values(icid) as icid by internal_message_id,host \
| eventstats values(sender) as src_user by internal_message_id,host \
| eventstats values(message_subject) as subject by internal_message_id,host \
| eventstats values(message_size) as size by internal_message_id,host \
| eventstats values(vendor_av_verdict) as vendor_av_verdict by internal_message_id,host \
| eventstats values(vendor_outbreak_verdict) as vendor_outbreak_verdict by internal_message_id,host \
| eventstats values(spam_status) as vendor_spam_verdict by internal_message_id,host \
| eventstats values(file_name) as file_name by internal_message_id,host \
| eventstats values(severity_id) as severity_id by internal_message_id,host \
| eventstats values(category) as category by internal_message_id,host \
| eventstats values(dest_ip) as dest_ip by dcid,host \
| eventstats values(vendor_ssl_cipher_outbound) as vendor_ssl_cipher_outbound by dcid,host \
| eval duration=_time-begin \
| search src_ip=* internal_message_id=* ((dest_ip=* action=*) OR action=quarantined OR (action=blocked recipient=*)) \
| rename source_domain as host \
| eval houragosnap = strptime(strftime(now()-3600,"%Y-%m-%d %H:00:00"),"%Y-%m-%d %H:%M:%S") \
| eval nowsnap = houragosnap + 3600 \
| where _time>houragosnap AND _time<nowsnap\
| table _time,host,internal_message_id,dcid,icid,mid_rid,src_ip,src_interface,dest_ip,src_user,recipient,recipient_count,action,size,duration,subject,file_name,recipient_status,vendor*verdict,vendor_ssl_cipher_inbound,vendor_ssl_cipher_outbound,severity_id,category\
| collect index=summary sourcetype=cisco:esa:messagetracking
